USE `dulumary`;

INSERT INTO `score` 
(`name`, `year`,`semester`,`term`,`subject`, `score`,`createdAt`,`updatedAt`)
VALUES
('이광수',2020,1, '중간고사','국어',80, now(),now()),
('이광수',2020,1, '중간고사','영어',90, now(),now()),
('이광수',2020,1, '중간고사','수학',85, now(),now()),

('조세호',2020,1, '기말고사','국어',70, now(),now()),
('조세호',2020,1, '기말고사','영어',80, now(),now()),
('조세호',2020,1, '기말고사','수학',60, now(),now()),
('유재석',2020,1, '기말고사','국어',90, now(),now()),
('유재석',2020,1, '기말고사','영어',100, now(),now()),
('유재석',2020,1, '기말고사','수학',95, now(),now()),
('이광수',2020,1, '기말고사','국어',80, now(),now()),
('이광수',2020,1, '기말고사','영어',75, now(),now()),
('이광수',2020,1, '기말고사','수학',90, now(),now()),

('조세호',2019,2, '기말고사','국어',85, now(),now()),
('조세호',2019,2, '기말고사','영어',80, now(),now()),
('조세호',2019,2, '기말고사','수학',70, now(),now()),
('유재석',2019,2, '기말고사','국어',95, now(),now()),
('유재석',2019,2, '기말고사','영어',90, now(),now()),
('유재석',2019,2, '기말고사','수학',80, now(),now()),
('이광수',2019,2, '기말고사','국어',75, now(),now()),
('이광수',2019,2, '기말고사','영어',80, now(),now()),
('이광수',2019,2, '기말고사','수학',100, now(),now());

SELECT* FROM `score`;

SELECT `name` as 이름, `subject` as 과목, `score` as 성적 FROM `score`;

SELECT `year`, `semester`, `term`, `subject`, `score` FROM `score` WHERE `name` = '유재석';

SELECT `score` FROM `score` WHERE `year` >= 2020;

SELECT `score` FROM `score` WHERE `year` = 2020 AND `semester` = 1;

SELECT COUNT(*) FROM `score` WHERE `name` = '유재석' AND `score` >= 90;


INSERT INTO `review` 
(`storeName`, `menu`,`userName`,`point`, `review`,`createdAt`, `updatedAt`)
VALUES ('배달삼겹','삼겹혼밥세트', '이정재',4.5, '배불리 먹었어요 추천!',  '2025-03-07 18:10:24' , '2025-03-07 18:10:24'), 
('도미노피자','콤비네이션L', '강동원',3.0,'너무 식어서 왔어요!', '2025-03-08 15:20:00','2025-03-08 15:20:00'), 
('BHC','마쵸킹', '전지현',5.0,'매우만족', '2025-03-08 17:20:00','2025-03-08 17:20:00'), 
('BBQ','올리브치킨', '이병헌',4.5, NULL, '2025-03-09 18:00:30','2025-03-09 18:00:30'), 
('피자반올림','하와이안피자', '이병헌',2.0,'누가 피자에 파인애플 맛있다고했어!', '2025-03-09 20:10:24','2025-03-09 20:10:24'), 
('교촌치킨','허니오리지날', '강동원',4.5,'역시 교촌은 허니 오리지날이죠!', '2025-03-10 14:30:50','2025-03-10 14:30:50'), 
('배달삼겹','목살혼밥세트', '이정재',4.0,NULL, '2025-03-10 19:43:56','2025-03-10 19:43:56'), 
('BHC','핫후라이드', '전지현',5.0,'오늘은 평범한맛!', '2025-03-11 13:05:12','2025-03-11 13:05:12'), 
('안동찜닭','매콤찜닭(소)', '맛있으면짖는개',4.0,'왈왈왈!!! 왈왈!!', '2025-03-11 15:15:33','2025-03-11 15:15:33'), 
('교촌치킨','오리지날콤보', '맛있으면짖는개',3.0,'....','2025-03-12 19:25:36', '2025-03-12 19:25:36'), 
('BHC','뿌링클', '전지현',5.0, NULL,  '2025-03-13 16:43:43','2025-03-13 16:43:43'), 
('배달삼겹','삼겹혼밥세트', '강동원',4.0,'오늘도 배부르게 잘 먹었습니다. 푸짐해요', '2025-03-13 22:33:24','2025-03-13 22:33:24'), 
('원조 곱창볶음','순대곱창볶음', '이정재',2.5,'먹고 탈났어요 ㅠ', '2025-03-14 11:24:43','2025-03-14 11:24:43'), 
('버거킹','콰토르치즈와퍼세트', '이병헌',4.0, NULL,  '2025-03-14 20:42:45','2025-03-14 20:42:45'),
('안동찜닭','찜닭(중)', '이정재',1.0, '배달이 안왔어요.',  '2025-03-15 20:42:45','2025-03-15 20:42:45'),
('버거킹','콰토르치즈와퍼세트', '이병헌',4.0, NULL,  '2025-03-16 20:42:45','2025-03-16 20:42:45');

SELECT* FROM `review`;

SELECT* FROM `review` WHERE `point` <= 3.0;

SELECT `menu`, `review`, `point` FROM `review` WHERE `storeName` = '교촌치킨' AND `review` IS NOT NULL;

SELECT COUNT(*) FROM `review` WHERE `userName` = '전지현' AND `storeName` = 'BHC';

SELECT `review` FROM `review` WHERE `userName` = '강동원' AND `createdAt` >= '2025-03-11 00:00:00';

-- 리뷰, 별점 둘다 한 인원에 대해서 조회 -- 
SELECT * FROM `review` WHERE (`userName` = '이정재' AND `review` IS NOT NULL) OR (`userName` = '이정재' AND `point` >= 4.5);